{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "from patra_agent.graph import run_patra_graph\n",
    "from langsmith import Client\n",
    "from langsmith.wrappers import wrap_openai\n",
    "from langsmith.evaluation import evaluate\n",
    "from langsmith import Client\n",
    "from langsmith.schemas import Run, Example\n",
    "from langsmith.utils import LangSmithError\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "from langsmith.evaluation import evaluate, LangChainStringEvaluator\n",
    "from langchain.schema.runnable import RunnablePassthrough\n",
    "from patra_agent.query_responses import query_dataset"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "client = Client()\n",
    "dataset_name = \"patra_agent_db05\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created new dataset: patra_agent_db05\n",
      "Using existing dataset: patra_agent_db05\n",
      "Added example: How many models are there in the system?\n",
      "Added example: How many edge devices are there in the system?\n",
      "Added example: What is the framework was used for model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model\n",
      "Added example: What is the accuracy of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model?\n",
      "Added example: What are the 5 models most closely resembling the one with ID e835e0f3-3c13-4ab8-9b17-a8c5ea8dc788?\n",
      "Added example: What is the architecture of edge device?\n",
      "Added example: Does the edge device with Device ID: jetson-nano-1 support AI operations ?\n",
      "Added example: What type of model is it?\n",
      "Added example: What is the name of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model?\n",
      "Added example: Who is the owner of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model?\n",
      "Added example: Who owns most of the models?\n",
      "Added example: Who is the author of the model card named, UCI Adult Data Analysis?\n",
      "Added example: How many unique device types are present in the database?\n",
      "Added example: Which model trained on the UCI Adult Dataset has the lowest demographic parity?\n",
      "Added example: What are the explainability metrics for model ID 3075715e-bac0-4783-bff9-4d8ea6a5f638?\n",
      "Added example: Which model deployed in SF-zone-02 has the highest fairness score?\n",
      "Added example: Which database is used for this datastorage?\n",
      "Added example: What do you know about UCI Machine Learning Repository?\n",
      "Added example: How many model cards are present in the system?\n",
      "Added example: Name the model cards are present in the system?\n",
      "Added example: How many bias analysis are present in UCI Adult Data Analysis?\n",
      "Added example: Name the edge device in the system?\n",
      "Added example: Which bias analysis has the lowest demographic parity difference?\n",
      "Added example: How many deployements are made for model ID 888a1c63-2d03-478d-92b9-b371c752306e-model?\n",
      "Added example: Name the datasheet?\n",
      "Finished adding examples to the dataset\n"
     ]
    }
   ],
   "source": [
    "\n",
    "dataset = client.create_dataset(dataset_name, description=\"patra checks\")\n",
    "print(f\"Created new dataset: {dataset_name}\")\n",
    "try:\n",
    "    dataset = client.read_dataset(dataset_name=dataset_name)\n",
    "    print(f\"Using existing dataset: {dataset_name}\")\n",
    "except LangSmithError:\n",
    "    dataset = client.create_dataset(dataset_name, description=\"battle prompts\")\n",
    "    print(f\"Created new dataset: {dataset_name}\")\n",
    "\n",
    "for qr in query_dataset:\n",
    "    try:\n",
    "        client.create_example(\n",
    "            inputs = qr[\"inputs\"],\n",
    "            outputs= qr[\"outputs\"],\n",
    "            dataset_id=dataset.id\n",
    "        )\n",
    "        print(f\"Added example: {qr['inputs']['question']}\")\n",
    "    except LangSmithError as e:\n",
    "        print(f\"Failed to add example: {qr['inputs']['question']}. Error: {str(e)}\")\n",
    "print(f\"Finished adding examples to the dataset\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "View the evaluation results for experiment: 'rasengan-generate01-d64b6023' at:\n",
      "https://smith.langchain.com/o/772db1be-0d45-5c99-ad5e-b5970a468c06/datasets/1dc49c6f-e953-400c-86fb-2ed55147b6b6/compare?selectedSessions=a11507b9-e1bb-412f-8883-f37d8873e637\n",
      "\n",
      "\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "0it [00:00, ?it/s]"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "Name the datasheet?================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "How many deployements are made for model ID 888a1c63-2d03-478d-92b9-b371c752306e-model?\n",
      "\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "Name the edge device in the system?\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "How many bias analysis are present in UCI Adult Data Analysis?\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "Which bias analysis has the lowest demographic parity difference?\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "Name the model cards are present in the system?\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "How many model cards are present in the system?\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "What do you know about UCI Machine Learning Repository?\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "Which database is used for this datastorage?\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "Which model deployed in SF-zone-02 has the highest fairness score?\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "What are the explainability metrics for model ID 3075715e-bac0-4783-bff9-4d8ea6a5f638?\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "Which model trained on the UCI Adult Dataset has the lowest demographic parity?\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (ds:Datasheet) RETURN ds.name\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (d:EdgeDevice) RETURN d.name\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (mc:ModelCard) RETURN COUNT(mc) AS NumberOfModelCards\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (mc:ModelCard) RETURN mc.name, mc.external_id\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (ds:Datasheet {name: 'UCI Machine Learning Repository'}) RETURN ds\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (ds:Datasheet) RETURN ds.name'}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'ds.name': 'UCI Adult Dataset'}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'ds.name': 'UCI Adult Dataset'}}]\u001b[0m\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (d:EdgeDevice) RETURN d.name'}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}, {{'d.name': 'Nvidia Jetson Nano'}}]\u001b[0m\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (mc:ModelCard) RETURN mc.name, mc.external_id'}`\n",
      "\n",
      "\n",
      "\u001b[0m\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (mc:ModelCard) RETURN COUNT(mc) AS NumberOfModelCards'}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '888a1c63-2d03-478d-92b9-b371c752306e'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': 'dc1b2d2c-1e50-4107-a9d9-9019f8737a1e'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': 'c6f13586-d926-4ee5-81d8-36f3fc9d6d53'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '79fdf2fc-d188-4ff5-8cba-04f5ee44d582'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': 'fab5ded2-9772-40a5-919b-fe2f7f73554f'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '85d2f849-ba3d-4b61-b6fc-01e1b2e78381'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '2994bd5b-a0ab-4944-bb86-5428372d707b'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': 'd3a5d6bc-0fd8-4196-86a7-527344e9f9c7'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '91652224-0abf-43d5-a2d4-5322dd93324a'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '712c305a-edc1-4f93-a9f6-a2a9ed46fdbd'}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '888a1c63-2d03-478d-92b9-b371c752306e'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': 'dc1b2d2c-1e50-4107-a9d9-9019f8737a1e'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': 'c6f13586-d926-4ee5-81d8-36f3fc9d6d53'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '79fdf2fc-d188-4ff5-8cba-04f5ee44d582'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': 'fab5ded2-9772-40a5-919b-fe2f7f73554f'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '85d2f849-ba3d-4b61-b6fc-01e1b2e78381'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '2994bd5b-a0ab-4944-bb86-5428372d707b'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': 'd3a5d6bc-0fd8-4196-86a7-527344e9f9c7'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '91652224-0abf-43d5-a2d4-5322dd93324a'}}, {{'mc.name': 'UCI Adult Data Analysis', 'mc.external_id': '712c305a-edc1-4f93-a9f6-a2a9ed46fdbd'}}]\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'NumberOfModelCards': 100}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'NumberOfModelCards': 100}}]\u001b[0m\u001b[32;1m\u001b[1;3mThe name of the datasheet is \"UCI Adult Dataset\".\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The name of the datasheet is \"UCI Adult Dataset\".\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "How many unique device types are present in the database?\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (mc:ModelCard)-[r:TRAINED_ON]-(ds:Datasheet {name: 'UCI Adult Dataset'})-[r2:BIAS_ANALYSIS]-(ba:BiasAnalysis) \n",
      "RETURN mc, ba.demographic_parity_diff \n",
      "ORDER BY ba.demographic_parity_diff ASC \n",
      "LIMIT 1\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (mc:ModelCard)-[r:BIAS_ANALYSIS]-(ba:BiasAnalysis) \n",
      "RETURN ba \n",
      "ORDER BY ba.demographic_parity_diff ASC \n",
      "LIMIT 1\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThe edge device in the system is named \"Nvidia Jetson Nano\".\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The edge device in the system is named \"Nvidia Jetson Nano\".\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "Who is the author of the model card named, UCI Adult Data Analysis?\n",
      "\u001b[32;1m\u001b[1;3mNumber of Model Cards: 100\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "Number of Model Cards: 100\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "Who owns most of the models?\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (mc:ModelCard {name: 'UCI Adult Data Analysis'})-[r:BIAS_ANALYSIS]-(ba:BiasAnalysis)\n",
      "RETURN COUNT(ba) AS NumberOfBiasAnalyses\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (ds:Datasheet) RETURN ds.source AS DatabaseUsedForDataStorage\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (ds:Datasheet {name: 'UCI Machine Learning Repository'}) RETURN ds;\"}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[]\u001b[0m==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (m:Model {model_id: '3075715e-bac0-4783-bff9-4d8ea6a5f638'})-[r:USED]-(mc:ModelCard)-[r2:XAI_ANALYSIS]-(ea:ExplainabilityAnalysis) RETURN ea\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (m:Model {model_id: '888a1c63-2d03-478d-92b9-b371c752306e-model'})-[r:HAS_DEPLOYMENT]-(depl:Deployment) RETURN COUNT(depl) AS NumberOfDeployments\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (ds:Datasheet) RETURN ds.source AS DatabaseUsedForDataStorage'}`\n",
      "\n",
      "\n",
      "\u001b[0m\u001b[32;1m\u001b[1;3mThere is no information available about the \"UCI Machine Learning Repository\" in the current database.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "There is no information available about the \"UCI Machine Learning Repository\" in the current database.\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "Who is the owner of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model?\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (d:EdgeDevice) RETURN COUNT(DISTINCT d.device_type) AS UniqueDeviceTypes\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'DatabaseUsedForDataStorage': 'UCI Machine Learning Repository'}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'DatabaseUsedForDataStorage': 'UCI Machine Learning Repository'}}]\u001b[0m==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (m:Model)-[:HAS_DEPLOYMENT]-(depl:Deployment)-[:DEPLOYED_IN]-(device:EdgeDevice {location: 'SF-zone-02'})\n",
      "MATCH (mc:ModelCard)-[:USED]-(m)\n",
      "MATCH (mc)-[:BIAS_ANALYSIS]-(ba:BiasAnalysis)\n",
      "RETURN m, mc.external_id, ba\n",
      "ORDER BY ba.equal_odds_difference DESC\n",
      "LIMIT 1\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (mc:ModelCard)-[r:BIAS_ANALYSIS]-(ba:BiasAnalysis) RETURN ba ORDER BY ba.demographic_parity_diff ASC LIMIT 1'}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'ba': {{'equal_odds_difference': -0.3787884779765942, 'name': '7e110269-8e1d-4a2c-b4db-c713b292d511bias_analysis', 'external_id': '7e110269-8e1d-4a2c-b4db-c713b292d511-bias', 'demographic_parity_diff': -0.9818984619471309}}}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'ba': {{'equal_odds_difference': -0.3787884779765942, 'name': '7e110269-8e1d-4a2c-b4db-c713b292d511bias_analysis', 'external_id': '7e110269-8e1d-4a2c-b4db-c713b292d511-bias', 'demographic_parity_diff': -0.9818984619471309}}}}]\u001b[0m\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (mc:ModelCard)-[r:TRAINED_ON]-(ds:Datasheet {name: 'UCI Adult Dataset'})-[r2:BIAS_ANALYSIS]-(ba:BiasAnalysis) RETURN mc, ba.demographic_parity_diff ORDER BY ba.demographic_parity_diff ASC LIMIT 1\"}`\n",
      "\n",
      "\n",
      "\u001b[0m==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (m:Model)\n",
      "RETURN m.owner, COUNT(m) AS model_count\n",
      "ORDER BY model_count DESC\n",
      "LIMIT 1\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (mc:ModelCard {name: 'UCI Adult Data Analysis'})-[r:BIAS_ANALYSIS]-(ba:BiasAnalysis) RETURN COUNT(ba) AS NumberOfBiasAnalyses\"}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'NumberOfBiasAnalyses': 100}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'NumberOfBiasAnalyses': 100}}]\u001b[0m==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (mc:ModelCard {name: 'UCI Adult Data Analysis'}) RETURN mc.author AS author\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: HAS_DEPLOYMENT)} {position: line: 1, column: 77, offset: 76} for query: \"MATCH (m:Model {model_id: '888a1c63-2d03-478d-92b9-b371c752306e-model'})-[r:HAS_DEPLOYMENT]-(depl:Deployment) RETURN COUNT(depl) AS NumberOfDeployments\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (m:Model {model_id: '888a1c63-2d03-478d-92b9-b371c752306e-model'})-[r:HAS_DEPLOYMENT]-(depl:Deployment) RETURN COUNT(depl) AS NumberOfDeployments\"}`\n",
      "\n",
      "\n",
      "\u001b[0m\u001b[32;1m\u001b[1;3mThe database used for data storage is the UCI Machine Learning Repository.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The database used for data storage is the UCI Machine Learning Repository.\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "What is the name of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model?\n",
      "\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'NumberOfDeployments': 0}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'NumberOfDeployments': 0}}]\u001b[0m\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (m:Model {model_id: '3075715e-bac0-4783-bff9-4d8ea6a5f638'})-[r:USED]-(mc:ModelCard)-[r2:XAI_ANALYSIS]-(ea:ExplainabilityAnalysis) RETURN ea;\"}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[]\u001b[0m"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: device_type)} {position: line: 1, column: 46, offset: 45} for query: 'MATCH (d:EdgeDevice) RETURN COUNT(DISTINCT d.device_type) AS UniqueDeviceTypes'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[32;1m\u001b[1;3mThe UCI Adult Data Analysis contains 100 bias analyses.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The UCI Adult Data Analysis contains 100 bias analyses.\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "What type of model is it?\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (d:EdgeDevice) RETURN COUNT(DISTINCT d.device_type) AS UniqueDeviceTypes'}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'UniqueDeviceTypes': 0}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'UniqueDeviceTypes': 0}}]\u001b[0m\u001b[32;1m\u001b[1;3mThe query did not return any results, which means there might not be any models trained on the UCI Adult Dataset with demographic parity information available in the database.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The query did not return any results, which means there might not be any models trained on the UCI Adult Dataset with demographic parity information available in the database.\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "Does the edge device with Device ID: jetson-nano-1 support AI operations ?\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (m:Model) RETURN m.owner, COUNT(m) AS model_count ORDER BY model_count DESC LIMIT 1'}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'m.owner': 'Sachith Withana', 'model_count': 100}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'m.owner': 'Sachith Withana', 'model_count': 100}}]\u001b[0m\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (mc:ModelCard {name: 'UCI Adult Data Analysis'}) RETURN mc.author AS author\"}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}, {{'author': 'Sachith Withana'}}]\u001b[0m==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (m:Model {model_id: '888a1c63-2d03-478d-92b9-b371c752306e-model'}) RETURN m.owner AS owner\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThe number of deployments made for the model with ID '888a1c63-2d03-478d-92b9-b371c752306e-model' is 0.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The number of deployments made for the model with ID '888a1c63-2d03-478d-92b9-b371c752306e-model' is 0.\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "What is the architecture of edge device?\n",
      "\u001b[32;1m\u001b[1;3mThere are no explainability metrics available for the model with ID 3075715e-bac0-4783-bff9-4d8ea6a5f638.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "There are no explainability metrics available for the model with ID 3075715e-bac0-4783-bff9-4d8ea6a5f638.\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "What are the 5 models most closely resembling the one with ID e835e0f3-3c13-4ab8-9b17-a8c5ea8dc788?\n",
      "\u001b[32;1m\u001b[1;3mThe number of unique device types present in the database is 0.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The number of unique device types present in the database is 0.\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "What is the accuracy of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model?\n",
      "\u001b[32;1m\u001b[1;3mThe owner with the most models is Sachith Withana, who owns 100 models.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The owner with the most models is Sachith Withana, who owns 100 models.\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "What is the framework was used for model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (m:Model {model_id: '888a1c63-2d03-478d-92b9-b371c752306e-model'}) RETURN m.name\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThe author of the model card named \"UCI Adult Data Analysis\" is Sachith Withana.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The author of the model card named \"UCI Adult Data Analysis\" is Sachith Withana.\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "How many edge devices are there in the system?\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Error running target function: Generated Cypher Statement is not valid\n",
      "{code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input '': expected an identifier (line 1, column 268 (offset: 267))\n",
      "\"MATCH (m:Model)-[:HAS_DEPLOYMENT]-(depl:Deployment)-[:DEPLOYED_IN]-(device:EdgeDevice {location: 'SF-zone-02'}) MATCH (mc:ModelCard)-[:USED]-(m) MATCH (mc)-[:BIAS_ANALYSIS]-(ba:BiasAnalysis) RETURN m, mc.external_id, ba ORDER BY ba.equal_odds_difference DESC LIMIT 1.\"\n",
      "                                                                                                                                                                                                                                                                            ^}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (m:Model)-[:HAS_DEPLOYMENT]-(depl:Deployment)-[:DEPLOYED_IN]-(device:EdgeDevice {location: 'SF-zone-02'}) MATCH (mc:ModelCard)-[:USED]-(m) MATCH (mc)-[:BIAS_ANALYSIS]-(ba:BiasAnalysis) RETURN m, mc.external_id, ba ORDER BY ba.equal_odds_difference DESC LIMIT 1.\"}`\n",
      "\n",
      "\n",
      "\u001b[0m==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (m:Model) RETURN m.model_type\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThe bias analysis with the lowest demographic parity difference is as follows:\n",
      "\n",
      "- Name: 7e110269-8e1d-4a2c-b4db-c713b292d511bias_analysis\n",
      "- External ID: 7e110269-8e1d-4a2c-b4db-c713b292d511-bias\n",
      "- Demographic Parity Difference: -0.9818984619471309\n",
      "- Equal Odds Difference: -0.3787884779765942\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The bias analysis with the lowest demographic parity difference is as follows:\n",
      "\n",
      "- Name: 7e110269-8e1d-4a2c-b4db-c713b292d511bias_analysis\n",
      "- External ID: 7e110269-8e1d-4a2c-b4db-c713b292d511-bias\n",
      "- Demographic Parity Difference: -0.9818984619471309\n",
      "- Equal Odds Difference: -0.3787884779765942\n",
      "================================\u001b[1m Human Message \u001b[0m=================================\n",
      "\n",
      "How many models are there in the system?\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (m:Model {model_id: '888a1c63-2d03-478d-92b9-b371c752306e-model'}) RETURN m.owner AS owner\"}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'owner': 'Sachith Withana'}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'owner': 'Sachith Withana'}}]\u001b[0m==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (d:EdgeDevice {device_id: 'jetson-nano-1'}) RETURN d.ai_capabilities_machine_learning AS supports_machine_learning, d.ai_capabilities_computer_vision AS supports_computer_vision, d.ai_capabilities_deep_learning AS supports_deep_learning\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (m:Model {model_id: '888a1c63-2d03-478d-92b9-b371c752306e-model'}) RETURN m.test_accuracy AS accuracy\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (m:Model) RETURN m.model_type'}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}, {{'m.model_type': 'dnn'}}]\u001b[0m==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (m:Model {model_id: '888a1c63-2d03-478d-92b9-b371c752306e-model'}) RETURN m.framework\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (d:EdgeDevice) RETURN d.cpu_architecture AS cpu_architecture, d.gpu_architecture AS gpu_architecture\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (m:Model {model_id: 'e835e0f3-3c13-4ab8-9b17-a8c5ea8dc788'})-[r:VERSION_OF]-(similar:Model)\n",
      "RETURN similar\n",
      "ORDER BY similar.model_id\n",
      "LIMIT 5\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (d:EdgeDevice) RETURN COUNT(d) AS NumberOfEdgeDevices\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (m:Model {model_id: '888a1c63-2d03-478d-92b9-b371c752306e-model'}) RETURN m.name\"}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'m.name': 'UCI Adult tensorflow model'}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'m.name': 'UCI Adult tensorflow model'}}]\u001b[0m\u001b[32;1m\u001b[1;3mThe model type is \"dnn\" (Deep Neural Network).\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The model type is \"dnn\" (Deep Neural Network).\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: query_agent\n",
      "\n",
      "MATCH (m:Model)\n",
      "RETURN COUNT(m) AS NumberOfModels\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mThe owner of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model is Sachith Withana.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The owner of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model is Sachith Withana.\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (m:Model {model_id: '888a1c63-2d03-478d-92b9-b371c752306e-model'}) RETURN m.test_accuracy AS accuracy\"}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'accuracy': 0.5686039666402652}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'accuracy': 0.5686039666402652}}]\u001b[0m\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (m:Model {model_id: '888a1c63-2d03-478d-92b9-b371c752306e-model'}) RETURN m.framework\"}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'m.framework': 'tensorflow'}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'m.framework': 'tensorflow'}}]\u001b[0m\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (d:EdgeDevice) RETURN d.cpu_architecture AS cpu_architecture, d.gpu_architecture AS gpu_architecture'}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}, {{'cpu_architecture': 'ARM Cortex-A57', 'gpu_architecture': 'Nvidia Maxwell'}}]\u001b[0m\u001b[32;1m\u001b[1;3mThe name of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model is \"UCI Adult tensorflow model\".\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The name of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model is \"UCI Adult tensorflow model\".\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (d:EdgeDevice {device_id: 'jetson-nano-1'}) RETURN d.ai_capabilities_machine_learning AS supports_machine_learning, d.ai_capabilities_computer_vision AS supports_computer_vision, d.ai_capabilities_deep_learning AS supports_deep_learning\"}`\n",
      "\n",
      "\n",
      "\u001b[0m\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (m:Model) RETURN COUNT(m) AS NumberOfModels'}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'supports_machine_learning': True, 'supports_computer_vision': True, 'supports_deep_learning': True}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'supports_machine_learning': True, 'supports_computer_vision': True, 'supports_deep_learning': True}}]\u001b[0m\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': 'MATCH (d:EdgeDevice) RETURN COUNT(d) AS NumberOfEdgeDevices'}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'NumberOfModels': 100}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'NumberOfModels': 100}}]\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[{{'NumberOfEdgeDevices': 10}}]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[{{'NumberOfEdgeDevices': 10}}]\u001b[0m"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: VERSION_OF)} {position: line: 1, column: 71, offset: 70} for query: \"MATCH (m:Model {model_id: 'e835e0f3-3c13-4ab8-9b17-a8c5ea8dc788'})-[r:VERSION_OF]-(similar:Model) RETURN similar ORDER BY similar.model_id LIMIT 5;\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `execute_cypher` with `{'query': \"MATCH (m:Model {model_id: 'e835e0f3-3c13-4ab8-9b17-a8c5ea8dc788'})-[r:VERSION_OF]-(similar:Model) RETURN similar ORDER BY similar.model_id LIMIT 5;\"}`\n",
      "\n",
      "\n",
      "\u001b[0m\n",
      "\n",
      "+++++++++++++++++++++++\n",
      "Running Cypher Query:\n",
      "[]\n",
      "+++++++++++++++++++++++\n",
      "+++++++++++++++++++++++\n",
      "\n",
      "\n",
      "\u001b[36;1m\u001b[1;3m[]\u001b[0m\u001b[32;1m\u001b[1;3mThere are 100 models in the system.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "There are 100 models in the system.\n",
      "\u001b[32;1m\u001b[1;3mThe number of edge devices in the system is 10.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The number of edge devices in the system is 10.\n",
      "\u001b[32;1m\u001b[1;3mThe accuracy of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model is approximately 56.86%.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The accuracy of the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model is approximately 56.86%.\n",
      "\u001b[32;1m\u001b[1;3mThe framework used for the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model is TensorFlow.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The framework used for the model with model ID 888a1c63-2d03-478d-92b9-b371c752306e-model is TensorFlow.\n",
      "\u001b[32;1m\u001b[1;3mThe architecture of the edge devices is as follows:\n",
      "\n",
      "- CPU Architecture: ARM Cortex-A57\n",
      "- GPU Architecture: Nvidia Maxwell\n",
      "\n",
      "This architecture is consistent across all the edge devices in the dataset.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The architecture of the edge devices is as follows:\n",
      "\n",
      "- CPU Architecture: ARM Cortex-A57\n",
      "- GPU Architecture: Nvidia Maxwell\n",
      "\n",
      "This architecture is consistent across all the edge devices in the dataset.\n",
      "\u001b[32;1m\u001b[1;3mThe edge device with Device ID: jetson-nano-1 supports the following AI operations:\n",
      "\n",
      "- Machine Learning: Yes\n",
      "- Computer Vision: Yes\n",
      "- Deep Learning: Yes\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The edge device with Device ID: jetson-nano-1 supports the following AI operations:\n",
      "\n",
      "- Machine Learning: Yes\n",
      "- Computer Vision: Yes\n",
      "- Deep Learning: Yes\n",
      "\u001b[32;1m\u001b[1;3mThe query did not return any models that are closely resembling the one with ID `e835e0f3-3c13-4ab8-9b17-a8c5ea8dc788`.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The query did not return any models that are closely resembling the one with ID `e835e0f3-3c13-4ab8-9b17-a8c5ea8dc788`.\n",
      "\u001b[32;1m\u001b[1;3mThe following model cards are present in the system:\n",
      "\n",
      "1. Name: UCI Adult Data Analysis\n",
      "   - External ID: 888a1c63-2d03-478d-92b9-b371c752306e\n",
      "   - External ID: dc1b2d2c-1e50-4107-a9d9-9019f8737a1e\n",
      "   - External ID: c6f13586-d926-4ee5-81d8-36f3fc9d6d53\n",
      "   - External ID: 79fdf2fc-d188-4ff5-8cba-04f5ee44d582\n",
      "   - External ID: fab5ded2-9772-40a5-919b-fe2f7f73554f\n",
      "   - External ID: 85d2f849-ba3d-4b61-b6fc-01e1b2e78381\n",
      "   - External ID: 2994bd5b-a0ab-4944-bb86-5428372d707b\n",
      "   - External ID: d3a5d6bc-0fd8-4196-86a7-527344e9f9c7\n",
      "   - External ID: 91652224-0abf-43d5-a2d4-5322dd93324a\n",
      "   - External ID: 712c305a-edc1-4f93-a9f6-a2a9ed46fdbd\n",
      "\n",
      "All model cards listed have the same name, \"UCI Adult Data Analysis,\" but different external IDs.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "==================================\u001b[1m Ai Message \u001b[0m==================================\n",
      "Name: db_executor\n",
      "\n",
      "The following model cards are present in the system:\n",
      "\n",
      "1. Name: UCI Adult Data Analysis\n",
      "   - External ID: 888a1c63-2d03-478d-92b9-b371c752306e\n",
      "   - External ID: dc1b2d2c-1e50-4107-a9d9-9019f8737a1e\n",
      "   - External ID: c6f13586-d926-4ee5-81d8-36f3fc9d6d53\n",
      "   - External ID: 79fdf2fc-d188-4ff5-8cba-04f5ee44d582\n",
      "   - External ID: fab5ded2-9772-40a5-919b-fe2f7f73554f\n",
      "   - External ID: 85d2f849-ba3d-4b61-b6fc-01e1b2e78381\n",
      "   - External ID: 2994bd5b-a0ab-4944-bb86-5428372d707b\n",
      "   - External ID: d3a5d6bc-0fd8-4196-86a7-527344e9f9c7\n",
      "   - External ID: 91652224-0abf-43d5-a2d4-5322dd93324a\n",
      "   - External ID: 712c305a-edc1-4f93-a9f6-a2a9ed46fdbd\n",
      "\n",
      "All model cards listed have the same name, \"UCI Adult Data Analysis,\" but different external IDs.\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "25it [00:41,  1.65s/it]\n"
     ]
    }
   ],
   "source": [
    "output_parser = StrOutputParser()\n",
    "\n",
    "def predict(inputs:dict) ->dict:\n",
    "    query = inputs[\"question\"]\n",
    "    result = run_patra_graph(query)\n",
    "    return result\n",
    "\n",
    "chain = RunnablePassthrough() | predict | output_parser\n",
    "\n",
    "\n",
    "def must_mention(run: Run, example: Example) -> dict:\n",
    "    prediction = run.outputs.get(\"output\") or \"\"\n",
    "    required = example.outputs.get(\"must_mention\") or []\n",
    "    score = all(phrase in prediction for phrase in required)\n",
    "    return {\"key\": \"must_mention\", \"score\": score}\n",
    "\n",
    "evaluators = [\n",
    "  LangChainStringEvaluator(\"cot_qa\"),\n",
    "  LangChainStringEvaluator(\"labeled_criteria\", config={\"criteria\": \"conciseness\"}),\n",
    "  LangChainStringEvaluator(\"labeled_criteria\", config={\"criteria\": \"helpfulness\"}),\n",
    "  LangChainStringEvaluator(\"labeled_criteria\", config={\"criteria\": \"detail\"})\n",
    "]\n",
    "experiment_results = evaluate(\n",
    "    chain.invoke, \n",
    "    data=dataset_name, \n",
    "    evaluators=evaluators, \n",
    "    experiment_prefix=\"rasengan-generate01\", \n",
    "    \n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".patra_agents_venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
